frontend/controllers/RefuseController.php

    public function actionView($id)
    {
        $query = new \yii\db\Query();
        $tablePrefix = Yii::$app->getDb()->tablePrefix;
        //商品及赠品
        $goodlist = $query->select('g.name,g.spec,b.name as bname,rog.sell_price,rog.number,rog.unit_name')->from($tablePrefix.'refuse_order_goods as rog')
            ->leftJoin($tablePrefix.'goods as g','rog.goods_id=g.goods_id')
            ->leftJoin($tablePrefix.'brand as b','g.brand_id=b.brand_id')
            ->where('rog.refuse_id='.$id)->all();

        return $this->render('view', [
            'model' => $this->findModel($id),
            'goodlist'  => $goodlist,
        ]);
---
SELECT * FROM `s2_refuse_order_goods` WHERE (`refuse_id`='2') AND (`goods_id`='2')