frontend/controllers/RefuseController.php

SELECT * FROM `s2_stocks` WHERE (`refuse_id`='2') AND (`goods_id`='2')
SELECT * FROM `s2_stocks` WHERE `stocks_id`=18
---
    public function actionHandle($refuse_id){
        $action = Yii::$app->request->get('action');
        if($action){
                if(!$refuse = RefuseModel::findOne($refuse_id))
                {
                    throw new NotFoundHttpException($refuse_id.'ID不存在！');
                }
                $goods = RefuseModel::getRefuseGoods($refuse_id);
                $transaction=Yii::$app->db->beginTransaction();
                try {
                    foreach($goods as $v) {
                        if ($model = StocksModel::findOne(['refuse_id' => $refuse_id, 'goods_id' => $v['goods_id']]))
                        {
                            if (!$model->delete()) {
                                throw new \Exception($refuse['goods_name'] . "商品取消退货入库操作失败！");
                            }
                        }else{
                            $refuses = RefuseGoodsModel::findOne(['refuse_id' => $refuse_id, 'goods_id' => $v['goods_id']]);
                            $model = StocksModel::findOne(['stocks_id' => $refuses['stocks_id']]);

UPDATE `s2_stocks` SET `stock_num`=90 WHERE `stocks_id`=18
---
                            $refuse = RefuseGoodsModel::findOne(['refuse_id' => $where['refuse_id'], 'goods_id' => $where['goods_id'][$k]]);
                            $refuse->stocks_id = $stocks['stocks_id'];
                            $stocks->stock_num = $stocks['stock_num'] + $where['number'][$k];
                            if ((!$stocks->save()) || (!$refuse->save())) {