frontend/components/menuHelper.php

    public static function getAssignmentMenu($parent){
        if (empty($parent)) {
            return [];
        }
        $db = new Query();
        $menu=$db->select('name,menu_name,parent')->from(Yii::$app->db->tablePrefix.'auth_item')->where(['parent'=>$parent,'type'=>2,'is_display'=>1])->orderBy(['sort'=>SORT_ASC])->all();
---
SELECT `name`, `menu_name`, `parent` FROM `s2_auth_item` WHERE (`parent`=5) AND (`type`=2) AND (`is_display`=1) ORDER BY `sort`

    public static  function getAuthData(){
        $query = new Query();
        $tablePrefix = Yii::$app->getDb()->tablePrefix;
        if(Yii::$app->user->identity->type==1 && Yii::$app->user->identity->store_id==0){
            return $query->select(['name','menu_name','parent','is_display'])
                ->from($tablePrefix.'auth_item')
                ->where(['type'=>2])
                ->andFilterWhere(['!=','menu_name','首页'])
                ->orderBy(['sort'=>SORT_ASC])
                ->all();
        }else{
            return $query->select(['name','menu_name','parent','is_display'])
                ->from($tablePrefix.'auth_item')
                ->where(['type'=>2])
                ->andFilterWhere(['!=','menu_name','首页'])
                ->andFilterWhere(['not like','name','store'])
                ->orderBy(['sort'=>SORT_ASC])
                ->all();
---
SELECT `name`, `menu_name`, `parent`, `is_display` FROM `s2_auth_item` WHERE ((`type`=2) AND (`menu_name` != '首页')) AND (`name` NOT LIKE '%store%') ORDER BY `sort`