frontend/components/Search.php

SELECT * FROM `s2_goods` WHERE `store_id`=1
---
    public static function SearchGoods(){
        $store_id = Yii::$app->user->identity->store_id;
        if($store_id){
            $goods = Goods::findAll(['store_id'=>$store_id]);