common/models/User.php

SELECT * FROM `s2_user` WHERE (`user_id`=2) AND (`status`=1)
---
    public static function findIdentity($id)
    {
        return static::findOne(['user_id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `s2_user` WHERE (`username`='test') AND (`status`=1)
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `s2_user` WHERE `user_id`=2
UPDATE `s2_user` SET `last_login_time`=1463471918, `updated_at`=1463471918 WHERE `user_id`=2
---
	public static function addLoginTime($id)
	{
		$userobj = static::findOne(['user_id'=>$id]);
		$userobj->last_login_time = time();
		return $userobj->save();