frontend/views/stocks/_search.php

SELECT `warehouse_id`, `name` FROM `s2_warehouse` WHERE status=1  and store_id=1
---
}else{
    $store_id="";
}
$warehose = $query->select('warehouse_id,name')->from('s2_warehouse')->where('status=1 '.$store_id)->all();