frontend/views/sale/saleok.php

}else{
    $store_id="";
}
$warehose = $query->select('warehouse_id,name')->from('s2_warehouse')->where('status=1 '.$store_id)->all();
//获取负责人
$shop = $query->select('shop_id,name')->from('s2_shop')->where('status=1 '.$store_id)->all();
$delivery = $query->select('delivery_id,name')->from('s2_expressway')->where('status=1 '.$store_id)->all();
---
SELECT `warehouse_id`, `name` FROM `s2_warehouse` WHERE status=1  and store_id=1
SELECT `shop_id`, `name` FROM `s2_shop` WHERE status=1  and store_id=1
SELECT `delivery_id`, `name` FROM `s2_expressway` WHERE status=1  and store_id=1