frontend/models/OrderModel.php

SELECT * FROM `s2_order_goods` WHERE `order_id`='1'
---
    public static function getOrderGoods($order_id){
        $tablePrefix = Yii::$app->getDb()->tablePrefix;
        $query = new \yii\db\Query();
       return  $query->select('*')->from($tablePrefix.'order_goods')->where(['order_id'=>$order_id])->all();