frontend/models/StocksModel.php

    public static function getGoodsStocks($goods_id,$warehouse_id){
        $tablePrefix = Yii::$app->getDb()->tablePrefix;
        $db = new \yii\db\Query;
        $db->select('s.batch_num,s.purchase_time,s.purchase_num,s.stock_num,s.unit_name')->from($tablePrefix.'stocks as s')
            ->where(['s.goods_id'=>$goods_id,'s.warehouse_id'=>$warehouse_id])
            ->orderBy(['s.stocks_id'=>SORT_DESC]);
        if(Yii::$app->user->identity->store_id>0){
            $db->andWhere(['s.store_id'=>Yii::$app->user->identity->store_id]);
        }
       return $db->all();
---
SELECT `s`.`batch_num`, `s`.`purchase_time`, `s`.`purchase_num`, `s`.`stock_num`, `s`.`unit_name` FROM `s2_stocks` `s` WHERE ((`s`.`goods_id`='2') AND (`s`.`warehouse_id`='1')) AND (`s`.`store_id`=1) ORDER BY `s`.`stocks_id` DESC